# CSE 4020 Machine Learning
## Lab Assignment - 3 

## Team - 8 (Greece and Italy)
### Saurav Rauniyar (18BCE2482)

                Group Discussion link :

In [1]:
import pandas as pd
import numpy as np 
import joblib
from sklearn.preprocessing import LabelEncoder
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import OneHotEncoder
from sklearn.metrics import r2_score
from sklearn.model_selection import train_test_split
from sklearn.compose import ColumnTransformer

# Loading the dataset

In [2]:
data = pd.read_csv('../Downloads/dataset.csv')
X = data.iloc[:,1:-1].values
y = data.iloc[:,6].values

In [3]:
data.head()

,Area,place,Bedrooms,Bathrooms,Interiorarea,exteriorarea,Price
0,"Aleomandra, Casa Reale Mykonos, Southern Aegean",Greece,10,10,11840,0.99,14349994
1,"Santa Maria, Alcaeus Paros, Southern Aegean",Greece,8,8,3552,2.47,12161012
2,"Ftelia, Alira Mykonos, Southern Aegean",Greece,26,30,15069,2.72,12161012
3,"Santa Maria, Sappho Paros, Southern Aegean Par...",Greece,7,6,3552,2.51,12161012
4,"Pirgi, Chateau Mykonos, Southern Aegean",Greece,17,17,13993,2.47,12039402

In [4]:
data.shape

(25, 7)

In [5]:
y

array([14349994, 12161012, 12161012, 12161012, 12039402, 11917792,
       11917792, 10701690,  9242369,  9120759,  9120759, 24322024,
       23105922, 23105922, 20673720, 18241518,  9120759,  9120759,
       10336860, 11917792, 18241518, 17025417, 17025417, 16417366,
       15809315], dtype=int64)

In [6]:
X

array([['Greece', 10, 10, 11840, 0.99],
       ['Greece', 8, 8, 3552, 2.47],
       ['Greece', 26, 30, 15069, 2.72],
       ['Greece', 7, 6, 3552, 2.51],
       ['Greece', 17, 17, 13993, 2.47],
       ['Greece', 7, 7, 7534, 1.0],
       ['Greece', 6, 7, 7750, 99.34],
       ['Greece', 9, 11, 7534, 0.99],
       ['Greece', 14, 14, 8611, 2.05],
       ['Greece', 8, 8, 7104, 0.99],
       ['Greece', 8, 12, 14531, 0.23],
       ['Italy', 10, 5, 12701, 0.0],
       ['Italy', 11, 9, 53819, 12.36],
       ['Italy', 70, 80, 123784, 2223.95],
       ['Italy', 35, 16, 48437, 98.84],
       ['Italy', 6, 9, 10225, 0.0],
       ['Italy', 8, 12, 14531, 0.23],
       ['Italy', 8, 8, 7104, 0.99],
       ['Greece', 7, 9, 7534, 8.22],
       ['Greece', 7, 8, 7534, 1.0],
       ['Italy', 7, 8, 9149, 0.0],
       ['Italy', 15, 10, 168508, 0.0],
       ['Italy', 19, 21, 43055, 291.58],
       ['Italy', 17, 17, 32291, 79.07],
       ['Italy', 80, 80, 170693, 1687.73]], dtype=object)

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Area          25 non-null     object
 1   place         25 non-null     object
 2   Bedrooms      25 non-null     int64
 3   Bathrooms     25 non-null     int64
 4   Interiorarea  25 non-null     int64
 5   exteriorarea  25 non-null     float64
 6   Price         25 non-null     int64
dtypes: float64(1), int64(4), object(2)
memory usage: 1.5+ KB

In [8]:
data.describe()

        Bedrooms  Bathrooms   Interiorarea  exteriorarea         Price
count  25.000000  25.000000      25.000000     25.000000  2.500000e+01
mean   16.800000  16.880000   32417.400000    180.789200  1.437432e+07
std    18.867962  19.768072   48538.110834    543.462395  4.770130e+06
min     6.000000   5.000000    3552.000000      0.000000  9.120759e+06
25%     7.000000   8.000000    7534.000000      0.990000  1.070169e+07
50%     9.000000  10.000000   11840.000000      2.050000  1.216101e+07
75%    17.000000  16.000000   32291.000000     12.360000  1.702542e+07
max    80.000000  80.000000  170693.000000   2223.950000  2.432202e+07

In [9]:
dummies = pd.get_dummies(data.place)
dummies

    Greece  Italy
0        1      0
1        1      0
2        1      0
3        1      0
4        1      0
5        1      0
6        1      0
7        1      0
8        1      0
9        1      0
10       1      0
11       0      1
12       0      1
13       0      1
14       0      1
15       0      1
16       0      1
17       0      1
18       1      0
19       1      0
20       0      1
21       0      1
22       0      1
23       0      1
24       0      1

In [10]:
#setting Greece and Italy to'1' and '0' as shown above.
ct = ColumnTransformer([("place", OneHotEncoder(), [0])], remainder = 'passthrough')
X = ct.fit_transform(X)

In [11]:
X

array([[1.0, 0.0, 10, 10, 11840, 0.99],
       [1.0, 0.0, 8, 8, 3552, 2.47],
       [1.0, 0.0, 26, 30, 15069, 2.72],
       [1.0, 0.0, 7, 6, 3552, 2.51],
       [1.0, 0.0, 17, 17, 13993, 2.47],
       [1.0, 0.0, 7, 7, 7534, 1.0],
       [1.0, 0.0, 6, 7, 7750, 99.34],
       [1.0, 0.0, 9, 11, 7534, 0.99],
       [1.0, 0.0, 14, 14, 8611, 2.05],
       [1.0, 0.0, 8, 8, 7104, 0.99],
       [1.0, 0.0, 8, 12, 14531, 0.23],
       [0.0, 1.0, 10, 5, 12701, 0.0],
       [0.0, 1.0, 11, 9, 53819, 12.36],
       [0.0, 1.0, 70, 80, 123784, 2223.95],
       [0.0, 1.0, 35, 16, 48437, 98.84],
       [0.0, 1.0, 6, 9, 10225, 0.0],
       [0.0, 1.0, 8, 12, 14531, 0.23],
       [0.0, 1.0, 8, 8, 7104, 0.99],
       [1.0, 0.0, 7, 9, 7534, 8.22],
       [1.0, 0.0, 7, 8, 7534, 1.0],
       [0.0, 1.0, 7, 8, 9149, 0.0],
       [0.0, 1.0, 15, 10, 168508, 0.0],
       [0.0, 1.0, 19, 21, 43055, 291.58],
       [0.0, 1.0, 17, 17, 32291, 79.07],
       [0.0, 1.0, 80, 80, 170693, 1687.73]], dtype=object)

# TRAIN, TEST, SPLIT

In [12]:

X_train,  X_test, y_train, y_test = train_test_split(X,y,test_size= 0.2, random_state =0)

In [13]:
print(X_train.shape, X_test.shape, y_train.shape, y_test.shape)

(20, 6) (5, 6) (20,) (5,)

# Linear Regression Model

In [14]:
#using linear regression model which is present in sklearn library.
regression = LinearRegression()
regression.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [15]:
y_pred = regression.predict(X_test)

In [16]:
r2_score(y_test, y_pred )

0.19177849111185408

In [17]:
df = pd.DataFrame(data=y_test, columns = ['y_test'])
df['y_pred'] = y_pred
df

     y_test        y_pred
0  11917792  1.196207e+07
1  12161012  5.365200e+06
2  11917792  1.151295e+07
3   9120759  1.547702e+07
4  24322024  1.900297e+07

# Sample data for the created model

In [18]:
ran_data = [1,0,14,18,45,21]
ran_data_arr = np.array(ran_data)
ran_data_num = ran_data_arr.reshape(1, -1)
pred_single_row = regression.predict(ran_data_num)
print ("The predicted price for house is  " , round(float(pred_single_row),2))

The predicted price for house is   8584513.47